[
  "We gladly welcome abstract submissions until the paper submission deadline. To ensure a smooth process, please submit both abstracts and papers together using the same Linklings submission form before the specified deadline.\n\nHigh-performance computing (HPC) plays a crucial role in tackling large and complex problems in science, engineering, and business by employing efficient algorithms, applications, systems, and software for massively parallel and distributed computing systems. The International Conference on High Performance Computing in the Asia-Pacific Region (HPC Asia) has established itself as a premier forum for researchers and professionals to exchange ideas and nurture innovation across all aspects of high-performance computing systems and applications.\n\nWith its upcoming 7th edition, HPC Asia 2024 aims to embrace the \"Stepping Forward to the Post Moore Era together\" motto. As we embark on the Exascale era, it is important to acknowledge that the Post Moore era will soon follow. HPC Asia 2024 will provide a unique opportunity to deliberate on the challenges that lie ahead in the Post Moore era. Furthermore, we will maintain our focus on the integration of HPC and AI. While the concept of the \"convergence\" of HPC and AI has been widely discussed, we firmly believe that interdisciplinary collaboration between HPC and AI is essential for ensuring the sustainability of computing in the Post Moore era.\n\nThe HPC Asia 24 consists of four tracks\nProgram Chairs:\nHiroyuki Takizawa (Tohoku University, Japan)\nKeita Teranishi (Oak Ridge National Laboratory, USA)\nApplication and Algorithms:\nTrack Chairs:\nHatem Ltaief (King Abdullah University of Science and Technology, Saudi Arabia)\nJiajia Li (North Calorina State University, USA)\nProgramming Models and System Software\nTrack Chairs:\nSeyong Lee (Oak Ridge National Laboratory, USA)\nPatrick McCormick (Los Alamos National Laboratory, USA)\nData, Storage and Visualization\nTrack Chairs:\nAna Gainaru (Oak Ridge National Laboratory, USA)\nMartin Schultz (Technical University Munich, Germany)\nArchitectures and Network\nTrack Chairs:\nMichihiro Koibuchi (National Institute of Informatics, Japan)\nSimon McIntosh-Smith (University of Bristol, UK)\nOnline Submission System\nSubmission System URL: https://ssl.linklings.net/conferences/HPCAsia/\n\nAuthors submitting papers for HPC Asia 24 must submit them via Linklings. Authors are invited to submit technical papers of at most 18 pages in PDF format including figures and references, formatted according to the ACM Proceedings Style and submitted through Linklings. Submitted papers must contain original work that has not appeared in and is not under consideration for another conference or journal. The review process is double-blind. There will be no revision/rebuttal process and the review will be one-pass.\n\nSubmission Format\n\nAll authors should submit manuscripts for review in a single-column format. Manuscripts must be at most 18 pages in PDF format including figures and references, formatted according to the ACM Proceedings Style. The ACM templates for Word and LaTeX are shown below. Also, ACM has partnered with Overleaf and the ACM LaTeX template on Overleaf platform is available. Please follow STEP 1 (Microsoft Word/LaTeX) at “2. The Workflow and Templates” in https://www.acm.org/publications/authors/submissions. Please note that there are two different instructions for Word and LaTeX template users.\n\nACM Templates\nWord:\nhttps://www.acm.org/binaries/content/assets/publications/taps/acm_submission_template.docx\nLaTeX:\nhttps://portalparts.acm.org/hippo/latex_templates/acmart-primary.zip\nuse a “manuscript” format option (Please refer to sample/sample-manuscript.tex).\nOverleaf:\nhttps://www.overleaf.com/latex/templates/acm-conference-proceedings-primary-article-template/wbvnghjbzwpc\nuse a “manuscript” format option.\n\nFor more details, please visit the ACM Primary Article Templates page.\n\nProceedings\n\nThe papers that have been accepted for HPC Asia 24 will be published as proceedings. However, the specific publisher for the proceedings is yet to be determined. The conference organizers are currently in the process of finalizing the details and will provide further information regarding the publisher soon.\n\nContact\n\nPlease contact the Programme Chair at hpca24-pc-chair [at] sighpc.ipsj.or.jp for any questions/clarifications about Call for Papers (CFP).\n\nFor queries on Papers – please indicate ‘’ at the start of your Subject heading of your email.\n\nProgram Committee\nApplication for Algorithms\nAditya Devarakonda (Wake Forest University)\nAniello Esposito (Hewlett Packard Enterprise)\nAsma Farjallah (NVIDIA)\nBora Ucar (University of Lyon)\nEdgar Solomonik (University of Illinois Urbana-Champaign)\nErin Claire Carson (Charles University)\nFlorina Ciorba (University of Basel)\nJames Lin (Shanghai Jiao Tong University)\nJee Choi (University of Oregon)\nKrzysztof Rzadca (Google and University of Warsaw)\nLuka Stanisic (Huawei Technologies Germany)\nMohamed Wahib (RIKEN-CCS)\nPiotr Luszczek (University of Tennessee)\nPiyush Sao (Oak Ridge National Laboratory)\nRonald Kriemann (Max Planck Institute for Math. i.t.S.)\nSameh Abdulah (King Abdullah University of Science and Technology)\nSarah Knepper (Intel)\nShigang Li (Beijing University of Posts and Telecommunications)\nSrinivas Eswar (Argonne National Laboratory)\nSunita Chandrasekaran (University of Delaware)\nUlrike Yang (Lawrence Livermore National Laboratory)\nVenkatesan Chakaravarthy (IBM Research)\nWeifeng Liu (China University of Petroleum)\nZeyi Wen (Hong Kong University of Science and Technology (Guangzhou))\nProgramming Models and System Software\nAmelie Chi Zhou (Shenzhen University)\nBalazs Gerofi (RIKEN Advanced Institute For Computational Science)\nDidem Unat (Koç University)\nElliott Slaughter (SLAC National Accelerator Laboratory)\nHyojin Sung (Pohang University of Science and Technology)\nJaejin Lee (Seoul National University)\nJingling Xue (University of New South Wales)\nJoel E. Denny (Oak Ridge National Laboratory)\nMiquel Pericas (Chalmers University of Technology)\nNaoya Maruyama (NVIDIA)\nNirmal Prajapati (Los Alamos National Lab)\nYunquan Zhang (ICT, CAS)\nData, Storage and Visualization\nAndre Brinkmann (Johannes Gutenberg University Mainz)\nBing Xie (Microsoft Corp)\nDavid Pugmire (Oak Ridge National Laboratory)\nFrancieli Zanon (University of Bordeaux)\nKate Isaacs (The University of Utah)\nKento Sato (RIKEN, R-CCS)\nLipeng Wan (Georgia State University)\nMatthieu Dorier (Argonne National Laboratory)\nOsamu Tatebe (University of Tsukuba)\nArchitectures and Network\nHayato Yamaki (The University of Electro-Communications)\nJose Flich (Technical University of Valencia)\nKenji Mizutani (National Institute of Advanced Industrial Science and Technology (AIST))\nRyan Grant (Queen's University)\nRyota Shioya (The University of Tokyo)\nRyusuke Egawa (Tokyo Denki University, Tohoku University)\nTruong Thao Nguyen (National Institute of Advanced Industrial Science and Technology)\nYujiro Ajima (Fujitsu Limited)"
]