[
  "The LREC-COLING template MUST be used for your submission(s). If not, your submission(s) will be rejected.\nVisit Author’s Kit Page\n\nTwo international key players in the area of computational linguistics, the ELRA Language Resources Association (ELRA) and the International Committee on Computational Linguistics (ICCL), are joining forces to organize the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation (LREC-COLING 2024) to be held in Torino, Italy on 20-25 May, 2024.\n\nIMPORTANT DATES\n\n(All deadlines are 11:59PM UTC-12:00 (“anywhere on Earth”)\n\n22 September 2023: Paper anonymity period starts\n20 October 2023: Final submissions due (long, short and position papers)\n20 October 2023: Workshop/Tutorial proposal submissions due\n22–29 January 2024: Author rebuttal period\n5 February 2024: Final reviewing\n19 February 2024: Notification of acceptance\n25 March 2024: Camera-ready due\n20-25 May 2024: LREC-COLING2024 conference\nSUBMISSION TOPICS\n\nLREC-COLING 2024 invites the submission of long and short papers featuring substantial, original, and unpublished research in all aspects of natural language and computation, language resources (LRs) and evaluation, including spoken and sign language and multimodal interaction. Submissions are invited in five broad categories: (i) theories, algorithms, and models, (ii) NLP applications, (iii) language resources, (iv) NLP evaluation and (v) topics of general interest. Submissions that span multiple categories are particularly welcome.rence\n\n(I) Theories, algorithms, and models\nDiscourse and Pragmatics\nExplainability and Interpretability of Large Language Models\nLanguage Modeling\nCL/NLP and Linguistic Theories\nCL/NLP for Cognitive Modeling and Psycholinguistics\nMachine Learning for CL/NLP\nMorphology and Word Segmentation\nSemantics\nTagging, Chunking, Syntax and Parsing\nTextual Inference\n(II) NLP applications\nApplications (including BioNLP and eHealth, NLP for legal purposes, NLP for Social Media and Journalism, etc.)\nDialogue and Interactive Systems\nDocument Classification, Topic Modeling, Information Retrieval and Cross-Lingual Retrieval\nInformation Extraction, Text Mining, and Knowledge Graph Derivation from Texts\nMachine Translation for Spoken/Written/Sign Languages, and Translation Aids\nSentiment Analysis, Opinion and Argument Mining\nSpeech Recognition/Synthesis and Spoken Language Understanding\nNatural Language Generation, Summarization and Simplification\nQuestion Answering\nOffensive Speech Detection and Analysis\nVision, Robotics, Multimodal and Grounded Language Acquisition\n(III) NLanguage resource design, creation, and use: text, speech, sign, gesture, image, in single or multimodal/multimedia data\nGuidelines, standards, best practices and models for LRs, interoperability\nMethodologies and tools for LRs construction, annotation, and acquisition\nOntologies, terminology and knowledge representation\nLRs and Semantic Web (including Linked Data, Knowledge Graphs, etc.)\nLRs and Crowdsourcing\nMetadata for LRs and semantic/content mark-up\nLRs in systems and applications such as information extraction, information retrieval, audio-visual and multimedia search, speech dictation, meeting transcription, Computer-Aided Language Learning, training and education, mobile communication, machine translation, speech translation, summarisation, semantic search, text mining, inferencing, reasoning, sentiment analysis/opinion mining, (speech-based) dialogue systems, natural language and multimodal/multisensory interactions, chatbots, voice-activated services, etc.\nUse of (multilingual) LRs in various fields of application like e-government, e-participation, e-culture, e-health, mobile applications, digital humanities, social sciences, etc.\nLRs in the age of deep neural networks\nOpen, linked and shared data and tools, open and collaborative architectures\nBias in language resources\nUser needs, LT for accessibility\n(IV) NLP evaluation methodologies\nNLP evaluation methodologies, protocols and measures\nBenchmarking of systems and products\nEvaluation metrics in Machine Learning\nUsability evaluation of HLT-based user interfaces and dialogue systems\nUser satisfaction evaluation\n(V) Topics of general interest\nMultilingual issues, language coverage and diversity, less-resourced languages\nReplicability and reproducibility issues\nOrganisational, economical, ethical and legal issues\nPriorities, perspectives, strategies in national and international policies\nInternational and national activities, projects and initiatives\nLREC-COLING 2024 invites high-quality submissions written in English. Submissions of three forms of papers will be considered:\n\n \n\nA. Regular long papers – up to eight (8) pages maximum*, presenting substantial, original, completed, and unpublished work.\n\nB. Short papers – up to four (4) pages*, describing a small focused contribution, negative results, system demonstrations, etc.\n\nC. Position papers – up to eight (8) pages*, discussing key hot topics, challenges and open issues, as well as cross-fertilization between computational linguistics and other disciplines.\n\n* Excluding any number of additional pages for references, ethical consideration, conflict-of-interest, as well as data and code availability statements.\n\nAppendices or supplementary material will be allowed ONLY in the final, camera-ready version, but not during submission, as papers should be reviewed without the need to refer to any supplementary materials.\n\nLinguistic examples, if any, should be presented in the original language but also glossed into English to allow accessibility for a broader audience. \n\nNote that paper types are decisions made orthogonal to the eventual, final form of presentation (i.e., oral versus poster).\n\nAUTHOR RESPONSIBILITIES\n\n \n\nPapers must be of original, previously-unpublished work. Papers must be anonymized to support double-blind reviewing. Submissions thus must not include authors’ names and affiliations. The submissions should also avoid links to non-anonymized repositories: the code should be either submitted as supplementary material in the final version of the paper, or as a link to an anonymized repository (e.g., Anonymous GitHub or Anonym Share). Papers that do not conform to these requirements will be rejected without review.\n\nIf the paper is available as a preprint, this must be indicated on the submission form but not in the paper itself. In addition, LREC-COLING 2024 will follow the same policy as ACL conferences establishing an anonymity period during which non-anonymous posting of preprints is not allowed.\n\nMore specifically, direct submissions to LREC-COLING 2024 may not be made available online (e.g. via a preprint server) in a non-anonymized form after September 22, 11:59PM UTC-12:00 (for arXiv, note that this refers to submission time).\n\nAlso included in that policy are instructions to reviewers to not rate papers down for not citing recent preprints. Authors are asked to cite published versions of papers instead of preprint versions when possible.\n\nPapers that have been or will be under consideration for other venues at the same time must be declared at submission time. If a paper is accepted for publication at LREC-COLING 2024, it must be immediately withdrawn from other venues. If a paper under review at LREC-COLING 2024 is accepted elsewhere and authors intend to proceed there, the LREC-COLING 2024 committee must be notified immediately.\n\nETHICS STATEMENT\n\n \n\nWe encourage all authors submitting to LREC-COLING 2024 to include an explicit ethics statement on the broader impact of their work, or other ethical considerations after the conclusion but before the references. The ethics statement will not count toward the page limit (8 pages for long, 4 pages for short papers).\n\nPRESENTATION REQUIREMENT\n\n \n\nAll papers accepted to the main conference track must be presented at the conference to appear in the proceedings, and at least one author must register for LREC-COLING2024.\n\nAll papers accepted to the main conference will be required to submit a presentation video. The conference will be hybrid, with an emphasis on encouraging interaction between the online and in-person modalities, and thus presentations can be either on-site or virtual.\n\nCONTACT\n\nConference website: https://lrec-coling-2024.lrec-conf.org/ \n\nEmail: contact@lrec-coling-2024.org\n\nTwitter: @LrecColing2024"
]